package DataBase;

import java.sql.Connection;
import java.sql.DriverManager;
import java.sql.SQLException;
import java.sql.Statement;
public class CreateEmpData {
	 
    static final String JDBC_DRIVER = "com.mysql.cj.jdbc.Driver";  
    static final String DB_URL = "jdbc:mysql://localhost:3306/HRsystem"
    		+ "?useSSL=false&allowPublicKeyRetrieval=true&serverTimezone=UTC";
  
    // DB username & password
    static final String USERNAME = "root";
    static final String PASSWORD = "12345678";
 
    public static void main(String[] args) {
        Connection conn = null;
        Statement stmt = null;
        try{
            Class.forName(JDBC_DRIVER);
            conn = DriverManager.getConnection(DB_URL,USERNAME,PASSWORD);
            stmt = conn.createStatement();
            String sql1 ,sql2 ,sql3;
  
            sql1 = "INSERT INTO Emp_Data " +
                  "VALUES"
                  + "('HR-0001','人力資源部','金智秀','Jisoo' ,'A223456789','2020-03-01','女','N','1995-01-03','0910123456','台北市中正區XXXXXX','政治大學','哲學系','jisoo1995@gmail.com'),"
                  + "('RD-0001','技術研發部','李知恩','IU'    ,'A223456000','2015-06-15','女','N','1993-05-16','0910123000','台北市大安區XXXXXX','清華大學','資工系','jieun1993@gmail.com'),"
                  + "('HR-0002','人力資源部','朴彩英','Rose'  ,'A211689004','2020-11-02','女','N','1997-02-11','0939123456','新北市板橋區XXXXXX','中央大學','企管系','Rose1997@gmail.com' ),"
                  + "('PR-0001','公共關係部','劉在錫','Jimmy' ,'A123456789','1995-08-14','男','Y','1972-08-14','0929111222','台北市南港區XXXXXX','世新大學','廣播系','jimmy1972@gmail.com'),"
                  + "('HR-0003','人力資源部','葉舒華','ShuHua','A223450000','2021-06-01','女','N','2000-01-06','0910222456','桃園市楊梅區XXXXXX','華岡藝校','戲劇科','ShuHua2000@gmail.com'),"
                  + "('RD-0002','技術研發部','曹薇娟','MiYeon','A299988111','2020-03-11','女','N','1997-01-31','0921102456','新北市永和區XXXXXX','中興大學','資工系','miyeon1997@gmail.com'),"
                  + "('RD-0003','技術研發部','宋仲基','JungGi','A100456789','2020-09-19','男','Y','1985-09-19','0933023456','台北市士林區XXXXXX','台灣大學','資工系','joongki1985@gmail.com')"
                  ;
            
            
            sql2 = "INSERT INTO Emp_Treat " +
                    "VALUES"
                    + "('HR-0001','2020-03-01','人力資源部','職員' ,'金智秀','Jisoo ', '800' ,'00011112222333','月薪','匯款', 56000 ,3000,3000,1000,2000,57000,'0000', 15, 3.5, 4),"
                    + "('RD-0001','2015-06-15','技術研發部','組長' ,'李知恩','IU'    , '812' ,'00011112222444','月薪','匯款', 78000 ,5500,5000,2500,3600,78600,'0000', 40, 0  , 2),"
                    + "('HR-0002','2020-11-02','人力資源部','實習生','朴彩英','Rose'  , NULL  , NULL           ,'時薪','付現', 34000 ,1000,1000,1000,1300,34300,'0000', 0 , 0  , 2),"
                    + "('PR-0001','1995-08-14','公共關係部','部長' ,'劉在錫','Jimmy' , '902' ,'00011112222555','月薪','匯款', 130000,8000,6500,4800,2500,126200,'0000', 33, 2 , 10),"
                    + "('HR-0003','2021-06-01','人力資源部','職員' ,'葉舒華','ShuHua', '806' ,'00011112222666','月薪','匯款', 35000 ,2000,1200,1000,3100,36300, '0000',  0, 0 ,  0),"
                    + "('RD-0002','2020-03-11','技術研發部','職員' ,'曹薇娟','MiYeon', '800' ,'00011112333333','月薪','匯款', 53000 ,3000,1800,1300,1800,52300, '0000', 60, 15, 0),"
                    + "('RD-0003','2020-09-19','技術研發部','經理' ,'宋仲基','JungGi', '816' ,'00011112222333','月薪','匯款', 83000 ,5000,3500,2600,4300,83200, '0000', 45, 5.5, 8)"
                    ;
                      
            
            sql3 = "INSERT INTO Emp_News " +
            		"VALUES"
            		           		
            		+ "('薪水怎麼談？人資教你薪資談判6大重點：別太早亮底牌','2021-03-06','人力資源部',"
            		+ "'許多年輕求職者之所以會不敢談薪水，或者談出無法說服人的價碼，都是因為不知道市場行情。所以，你要先知道在整體就業市場中，自己所處的地域及該職務的平均待遇值。了解大略行情後，開始盤點自己有沒有特殊的專業技能，若剛好有公司需要的，這樣你就有可以增加談判的籌碼。' ),"
            		                             		
            		+ "('日本政府將補助設立研發中心，台積電攜手日夥伴推動半導體技術','2021-07-08','技術研發部',"
            		+ "'南韓政府表示，計畫在 2030 年之前，於電動汽車電池行業投資 40.6 兆韓元 (350 億美元)，確保在這一產業成為全球要角，力抗目前占主導地位的中國與日本。'),"
            		
            		+ "('南韓計畫投入350億美元，扶植國內電動車電池產業','2021-08-31','技術研發部',"
            		+ "'日本政府今 (31) 日拍板，將針對台積電 (2330-TW) 在日本設立先進材料研發中心給予補助，對此，台積電回應，感謝日本政府的支持，讓台積電可與日本夥伴共同攜手，推動半導體技術向前邁進。' ),"

            		+ "('保時捷攜手森那美，在馬來西亞設汽車組裝廠','2021-08-31','技術研發部',"
            		+ "'德國保時捷 (Porsche) 30 日 (週一) 宣布，將與馬來西亞的森那美 (Sime Darby) 集團合作，2022 年在馬來西亞興建汽車組裝廠，這是保時捷在歐洲地區以外的首座汽車組裝廠，未來將負責東南亞市場的汽車組裝作業。' ),"
            		                		
            		+ "('劉在錫7月剛簽柳熙烈公司　中秋節送所有員工韓牛⋯高級禮盒曝光','2021-09-16','公共關係部',"
            		+ "'一年一度中秋節，南韓也會迎來接近1週的放假假期，各家公司除了給予獎金，偶爾也會送上禮盒。「國民MC」劉在錫7月簽給好友柳熙烈公司Antenna，為了表達心意，他送上高級韓牛組合給每位員工，歌手鄭在炯15日在IG限時動態貼文，才因此曝光此事，令網友讚嘆直呼「不愧是劉在錫」、「油花看起來就很厲害」。'),"
            		
            		+ "('IU迎出道13週年捐贈價值近470萬元物資','2021-09-17','公共關係部',"
            		+ "'韓聯社首爾9月17日電 經紀公司EDAM娛樂17日表示，旗下歌手兼演員IU（李知恩）在其出道13週年之際，攜手其代言的京東制藥止痛藥“在那天”和濟州三多水向弱勢群體和篩查診所捐贈價值達8.5億韓元（約合人民幣465.8萬元）的物資。'),"
            		
            		+ "('你有創業夢嗎？第一次微型創業平均28歲　維持3.9年','2021-09-23','人力資源部',"
            		+ "'創業是夢想？還是災難？104玩數據分析1.9萬名求職會員、共計2萬筆創業經歷，即，工作經歷帶有創業、老闆、合夥、創辦人等關鍵字，86%屬於5人以下的微型創業，第一次創業平均28歲，最多投入餐飲餐館、鞋類布類服飾品批發/零售(店舖、網拍)；平均創業1.06次，最多6次；平均維持3.9年，最短29天，最長42年。' ),"
            		
            		+ "('能源公司總裁讚神韻男高音：聲音充滿能量','2021-09-26','公共關係部',"
            		+ "'神韻紐約藝術團在休斯頓沃瑟姆劇院（HOUSTON Wortham Center Brown Theater）的第四場演出持續爆滿。神韻舞台流光溢彩，卓絕的音樂與舞蹈完美結合，一幅幅超凡入聖的畫面迎面而來，學養深厚的中國五千年神傳文化古風再現。' ),"
            		
            		+ "('半導體產業的未來職涯會如何發展？破除你對高薪半導體產業的「3大刻板印象」！','2021-09-27','人力資源部',"
            		+ "'相信許多職場朋友們，都對台灣高薪又前景看好的半導體產業又愛又怕。既嚮往半導體產業光鮮亮麗的科技光環，又擔心那些謠傳的辛苦、壓力和爆肝工時。')"
            		
            		
            	
            		
            		
            		
            		
            		;
            
            stmt.executeUpdate(sql1);
            stmt.executeUpdate(sql2);
            stmt.executeUpdate(sql3);
   
            stmt.close();
            conn.close();
        }catch(Exception e){
            // handle Class.forName error
            e.printStackTrace();
        }finally{
            // 收尾處理，關閉一些資料
            try{
                if(stmt!=null) stmt.close();
            }catch(SQLException se2){
            }
            try{
                if(conn!=null) conn.close();
            }catch(SQLException se){
                se.printStackTrace();
            }
        }
        System.out.println("Exit create DB to Mysql DB Example!");
		
        }

}

